{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_277", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_277"}, "inbound_nodes": []}, {"name": "input_278", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_278"}, "inbound_nodes": []}, {"name": "input_279", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_279"}, "inbound_nodes": []}, {"name": "input_280", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_280"}, "inbound_nodes": []}, {"name": "input_281", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_281"}, "inbound_nodes": []}, {"name": "input_282", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_282"}, "inbound_nodes": []}, {"name": "input_283", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_283"}, "inbound_nodes": []}, {"name": "input_284", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_284"}, "inbound_nodes": []}, {"name": "input_285", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_285"}, "inbound_nodes": []}, {"name": "input_286", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_286"}, "inbound_nodes": []}, {"name": "input_287", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_287"}, "inbound_nodes": []}, {"name": "input_288", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_288"}, "inbound_nodes": []}, {"name": "input_289", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_289"}, "inbound_nodes": []}, {"name": "input_290", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_290"}, "inbound_nodes": []}, {"name": "input_291", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_291"}, "inbound_nodes": []}, {"name": "input_292", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_292"}, "inbound_nodes": []}, {"name": "input_293", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_293"}, "inbound_nodes": []}, {"name": "input_294", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_294"}, "inbound_nodes": []}, {"name": "input_295", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_295"}, "inbound_nodes": []}, {"name": "input_296", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_296"}, "inbound_nodes": []}, {"name": "input_297", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_297"}, "inbound_nodes": []}, {"name": "input_298", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_298"}, "inbound_nodes": []}, {"name": "embedding_0", "class_name": "Embedding", "config": {"name": "embedding_0", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_277", 0, 0, {}]]]}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_278", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 10, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_279", 0, 0, {}]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_280", 0, 0, {}]]]}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 9, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_281", 0, 0, {}]]]}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_282", 0, 0, {}]]]}, {"name": "embedding_6", "class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_283", 0, 0, {}]]]}, {"name": "embedding_7", "class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_284", 0, 0, {}]]]}, {"name": "embedding_8", "class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 12, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_285", 0, 0, {}]]]}, {"name": "embedding_9", "class_name": "Embedding", "config": {"name": "embedding_9", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_286", 0, 0, {}]]]}, {"name": "embedding_10", "class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_287", 0, 0, {}]]]}, {"name": "embedding_11", "class_name": "Embedding", "config": {"name": "embedding_11", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_288", 0, 0, {}]]]}, {"name": "embedding_12", "class_name": "Embedding", "config": {"name": "embedding_12", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_289", 0, 0, {}]]]}, {"name": "embedding_13", "class_name": "Embedding", "config": {"name": "embedding_13", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 9, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_290", 0, 0, {}]]]}, {"name": "embedding_14", "class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 9, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_291", 0, 0, {}]]]}, {"name": "embedding_15", "class_name": "Embedding", "config": {"name": "embedding_15", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_292", 0, 0, {}]]]}, {"name": "embedding_16", "class_name": "Embedding", "config": {"name": "embedding_16", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_293", 0, 0, {}]]]}, {"name": "embedding_17", "class_name": "Embedding", "config": {"name": "embedding_17", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_294", 0, 0, {}]]]}, {"name": "embedding_18", "class_name": "Embedding", "config": {"name": "embedding_18", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_295", 0, 0, {}]]]}, {"name": "embedding_19", "class_name": "Embedding", "config": {"name": "embedding_19", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 9, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_296", 0, 0, {}]]]}, {"name": "embedding_20", "class_name": "Embedding", "config": {"name": "embedding_20", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 6, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_297", 0, 0, {}]]]}, {"name": "embedding_21", "class_name": "Embedding", "config": {"name": "embedding_21", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 7, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_298", 0, 0, {}]]]}, {"name": "reshape_277", "class_name": "Reshape", "config": {"name": "reshape_277", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_0", 0, 0, {}]]]}, {"name": "reshape_278", "class_name": "Reshape", "config": {"name": "reshape_278", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "reshape_279", "class_name": "Reshape", "config": {"name": "reshape_279", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "reshape_280", "class_name": "Reshape", "config": {"name": "reshape_280", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "reshape_281", "class_name": "Reshape", "config": {"name": "reshape_281", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "reshape_282", "class_name": "Reshape", "config": {"name": "reshape_282", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "reshape_283", "class_name": "Reshape", "config": {"name": "reshape_283", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"name": "reshape_284", "class_name": "Reshape", "config": {"name": "reshape_284", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"name": "reshape_285", "class_name": "Reshape", "config": {"name": "reshape_285", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_8", 0, 0, {}]]]}, {"name": "reshape_286", "class_name": "Reshape", "config": {"name": "reshape_286", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_9", 0, 0, {}]]]}, {"name": "reshape_287", "class_name": "Reshape", "config": {"name": "reshape_287", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_10", 0, 0, {}]]]}, {"name": "reshape_288", "class_name": "Reshape", "config": {"name": "reshape_288", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_11", 0, 0, {}]]]}, {"name": "reshape_289", "class_name": "Reshape", "config": {"name": "reshape_289", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_12", 0, 0, {}]]]}, {"name": "reshape_290", "class_name": "Reshape", "config": {"name": "reshape_290", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "reshape_291", "class_name": "Reshape", "config": {"name": "reshape_291", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"name": "reshape_292", "class_name": "Reshape", "config": {"name": "reshape_292", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_15", 0, 0, {}]]]}, {"name": "reshape_293", "class_name": "Reshape", "config": {"name": "reshape_293", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_16", 0, 0, {}]]]}, {"name": "reshape_294", "class_name": "Reshape", "config": {"name": "reshape_294", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_17", 0, 0, {}]]]}, {"name": "reshape_295", "class_name": "Reshape", "config": {"name": "reshape_295", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_18", 0, 0, {}]]]}, {"name": "reshape_296", "class_name": "Reshape", "config": {"name": "reshape_296", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"name": "reshape_297", "class_name": "Reshape", "config": {"name": "reshape_297", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"name": "reshape_298", "class_name": "Reshape", "config": {"name": "reshape_298", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_21", 0, 0, {}]]]}, {"name": "embedding", "class_name": "Concatenate", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["reshape_277", 0, 0, {}], ["reshape_278", 0, 0, {}], ["reshape_279", 0, 0, {}], ["reshape_280", 0, 0, {}], ["reshape_281", 0, 0, {}], ["reshape_282", 0, 0, {}], ["reshape_283", 0, 0, {}], ["reshape_284", 0, 0, {}], ["reshape_285", 0, 0, {}], ["reshape_286", 0, 0, {}], ["reshape_287", 0, 0, {}], ["reshape_288", 0, 0, {}], ["reshape_289", 0, 0, {}], ["reshape_290", 0, 0, {}], ["reshape_291", 0, 0, {}], ["reshape_292", 0, 0, {}], ["reshape_293", 0, 0, {}], ["reshape_294", 0, 0, {}], ["reshape_295", 0, 0, {}], ["reshape_296", 0, 0, {}], ["reshape_297", 0, 0, {}], ["reshape_298", 0, 0, {}]]]}, {"name": "fully-connected-1", "class_name": "Dense", "config": {"name": "fully-connected-1", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-1", 0, 0, {}]]]}, {"name": "fully-connected-2", "class_name": "Dense", "config": {"name": "fully-connected-2", "trainable": true, "dtype": "float32", "units": 500, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-2", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["output", 0, 0, {}]]]}], "input_layers": [["input_277", 0, 0], ["input_278", 0, 0], ["input_279", 0, 0], ["input_280", 0, 0], ["input_281", 0, 0], ["input_282", 0, 0], ["input_283", 0, 0], ["input_284", 0, 0], ["input_285", 0, 0], ["input_286", 0, 0], ["input_287", 0, 0], ["input_288", 0, 0], ["input_289", 0, 0], ["input_290", 0, 0], ["input_291", 0, 0], ["input_292", 0, 0], ["input_293", 0, 0], ["input_294", 0, 0], ["input_295", 0, 0], ["input_296", 0, 0], ["input_297", 0, 0], ["input_298", 0, 0]], "output_layers": [["activation_9", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}