{"class_name": "Model", "config": {"name": "model_9", "layers": [{"name": "input_415", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_415"}, "inbound_nodes": []}, {"name": "input_416", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_416"}, "inbound_nodes": []}, {"name": "input_417", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_417"}, "inbound_nodes": []}, {"name": "input_418", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_418"}, "inbound_nodes": []}, {"name": "input_419", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_419"}, "inbound_nodes": []}, {"name": "input_420", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_420"}, "inbound_nodes": []}, {"name": "embedding_0", "class_name": "Embedding", "config": {"name": "embedding_0", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_415", 0, 0, {}]]]}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_416", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_417", 0, 0, {}]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_418", 0, 0, {}]]]}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_419", 0, 0, {}]]]}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_420", 0, 0, {}]]]}, {"name": "reshape_415", "class_name": "Reshape", "config": {"name": "reshape_415", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_0", 0, 0, {}]]]}, {"name": "reshape_416", "class_name": "Reshape", "config": {"name": "reshape_416", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "reshape_417", "class_name": "Reshape", "config": {"name": "reshape_417", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "reshape_418", "class_name": "Reshape", "config": {"name": "reshape_418", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "reshape_419", "class_name": "Reshape", "config": {"name": "reshape_419", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "reshape_420", "class_name": "Reshape", "config": {"name": "reshape_420", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "embedding", "class_name": "Concatenate", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["reshape_415", 0, 0, {}], ["reshape_416", 0, 0, {}], ["reshape_417", 0, 0, {}], ["reshape_418", 0, 0, {}], ["reshape_419", 0, 0, {}], ["reshape_420", 0, 0, {}]]]}, {"name": "fully-connected-1", "class_name": "Dense", "config": {"name": "fully-connected-1", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-1", 0, 0, {}]]]}, {"name": "fully-connected-2", "class_name": "Dense", "config": {"name": "fully-connected-2", "trainable": true, "dtype": "float32", "units": 500, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-2", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["output", 0, 0, {}]]]}], "input_layers": [["input_415", 0, 0], ["input_416", 0, 0], ["input_417", 0, 0], ["input_418", 0, 0], ["input_419", 0, 0], ["input_420", 0, 0]], "output_layers": [["activation_27", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}