{"class_name": "Model", "config": {"name": "model_13", "layers": [{"name": "input_464", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_464"}, "inbound_nodes": []}, {"name": "input_465", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_465"}, "inbound_nodes": []}, {"name": "input_466", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_466"}, "inbound_nodes": []}, {"name": "input_467", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_467"}, "inbound_nodes": []}, {"name": "input_468", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_468"}, "inbound_nodes": []}, {"name": "input_469", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_469"}, "inbound_nodes": []}, {"name": "input_470", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_470"}, "inbound_nodes": []}, {"name": "input_471", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_471"}, "inbound_nodes": []}, {"name": "input_472", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_472"}, "inbound_nodes": []}, {"name": "input_473", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_473"}, "inbound_nodes": []}, {"name": "input_474", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_474"}, "inbound_nodes": []}, {"name": "input_475", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_475"}, "inbound_nodes": []}, {"name": "input_476", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_476"}, "inbound_nodes": []}, {"name": "input_477", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_477"}, "inbound_nodes": []}, {"name": "input_478", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_478"}, "inbound_nodes": []}, {"name": "input_479", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_479"}, "inbound_nodes": []}, {"name": "input_480", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_480"}, "inbound_nodes": []}, {"name": "input_481", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_481"}, "inbound_nodes": []}, {"name": "input_482", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_482"}, "inbound_nodes": []}, {"name": "input_483", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_483"}, "inbound_nodes": []}, {"name": "input_484", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_484"}, "inbound_nodes": []}, {"name": "input_485", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_485"}, "inbound_nodes": []}, {"name": "input_486", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_486"}, "inbound_nodes": []}, {"name": "input_487", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_487"}, "inbound_nodes": []}, {"name": "input_488", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_488"}, "inbound_nodes": []}, {"name": "input_489", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_489"}, "inbound_nodes": []}, {"name": "input_490", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_490"}, "inbound_nodes": []}, {"name": "input_491", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_491"}, "inbound_nodes": []}, {"name": "input_492", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_492"}, "inbound_nodes": []}, {"name": "input_493", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_493"}, "inbound_nodes": []}, {"name": "input_494", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_494"}, "inbound_nodes": []}, {"name": "input_495", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_495"}, "inbound_nodes": []}, {"name": "input_496", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_496"}, "inbound_nodes": []}, {"name": "input_497", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_497"}, "inbound_nodes": []}, {"name": "input_498", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_498"}, "inbound_nodes": []}, {"name": "input_499", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_499"}, "inbound_nodes": []}, {"name": "input_500", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_500"}, "inbound_nodes": []}, {"name": "input_501", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_501"}, "inbound_nodes": []}, {"name": "input_502", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_502"}, "inbound_nodes": []}, {"name": "input_503", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_503"}, "inbound_nodes": []}, {"name": "input_504", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_504"}, "inbound_nodes": []}, {"name": "input_505", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_505"}, "inbound_nodes": []}, {"name": "embedding_0", "class_name": "Embedding", "config": {"name": "embedding_0", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_464", 0, 0, {}]]]}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_465", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_466", 0, 0, {}]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_467", 0, 0, {}]]]}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_468", 0, 0, {}]]]}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_469", 0, 0, {}]]]}, {"name": "embedding_6", "class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_470", 0, 0, {}]]]}, {"name": "embedding_7", "class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_471", 0, 0, {}]]]}, {"name": "embedding_8", "class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_472", 0, 0, {}]]]}, {"name": "embedding_9", "class_name": "Embedding", "config": {"name": "embedding_9", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_473", 0, 0, {}]]]}, {"name": "embedding_10", "class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_474", 0, 0, {}]]]}, {"name": "embedding_11", "class_name": "Embedding", "config": {"name": "embedding_11", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_475", 0, 0, {}]]]}, {"name": "embedding_12", "class_name": "Embedding", "config": {"name": "embedding_12", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_476", 0, 0, {}]]]}, {"name": "embedding_13", "class_name": "Embedding", "config": {"name": "embedding_13", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_477", 0, 0, {}]]]}, {"name": "embedding_14", "class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_478", 0, 0, {}]]]}, {"name": "embedding_15", "class_name": "Embedding", "config": {"name": "embedding_15", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_479", 0, 0, {}]]]}, {"name": "embedding_16", "class_name": "Embedding", "config": {"name": "embedding_16", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_480", 0, 0, {}]]]}, {"name": "embedding_17", "class_name": "Embedding", "config": {"name": "embedding_17", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_481", 0, 0, {}]]]}, {"name": "embedding_18", "class_name": "Embedding", "config": {"name": "embedding_18", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_482", 0, 0, {}]]]}, {"name": "embedding_19", "class_name": "Embedding", "config": {"name": "embedding_19", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_483", 0, 0, {}]]]}, {"name": "embedding_20", "class_name": "Embedding", "config": {"name": "embedding_20", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_484", 0, 0, {}]]]}, {"name": "embedding_21", "class_name": "Embedding", "config": {"name": "embedding_21", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_485", 0, 0, {}]]]}, {"name": "embedding_22", "class_name": "Embedding", "config": {"name": "embedding_22", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_486", 0, 0, {}]]]}, {"name": "embedding_23", "class_name": "Embedding", "config": {"name": "embedding_23", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_487", 0, 0, {}]]]}, {"name": "embedding_24", "class_name": "Embedding", "config": {"name": "embedding_24", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_488", 0, 0, {}]]]}, {"name": "embedding_25", "class_name": "Embedding", "config": {"name": "embedding_25", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_489", 0, 0, {}]]]}, {"name": "embedding_26", "class_name": "Embedding", "config": {"name": "embedding_26", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_490", 0, 0, {}]]]}, {"name": "embedding_27", "class_name": "Embedding", "config": {"name": "embedding_27", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_491", 0, 0, {}]]]}, {"name": "embedding_28", "class_name": "Embedding", "config": {"name": "embedding_28", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_492", 0, 0, {}]]]}, {"name": "embedding_29", "class_name": "Embedding", "config": {"name": "embedding_29", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_493", 0, 0, {}]]]}, {"name": "embedding_30", "class_name": "Embedding", "config": {"name": "embedding_30", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_494", 0, 0, {}]]]}, {"name": "embedding_31", "class_name": "Embedding", "config": {"name": "embedding_31", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_495", 0, 0, {}]]]}, {"name": "embedding_32", "class_name": "Embedding", "config": {"name": "embedding_32", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_496", 0, 0, {}]]]}, {"name": "embedding_33", "class_name": "Embedding", "config": {"name": "embedding_33", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_497", 0, 0, {}]]]}, {"name": "embedding_34", "class_name": "Embedding", "config": {"name": "embedding_34", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_498", 0, 0, {}]]]}, {"name": "embedding_35", "class_name": "Embedding", "config": {"name": "embedding_35", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_499", 0, 0, {}]]]}, {"name": "embedding_36", "class_name": "Embedding", "config": {"name": "embedding_36", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_500", 0, 0, {}]]]}, {"name": "embedding_37", "class_name": "Embedding", "config": {"name": "embedding_37", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_501", 0, 0, {}]]]}, {"name": "embedding_38", "class_name": "Embedding", "config": {"name": "embedding_38", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_502", 0, 0, {}]]]}, {"name": "embedding_39", "class_name": "Embedding", "config": {"name": "embedding_39", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_503", 0, 0, {}]]]}, {"name": "embedding_40", "class_name": "Embedding", "config": {"name": "embedding_40", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_504", 0, 0, {}]]]}, {"name": "embedding_41", "class_name": "Embedding", "config": {"name": "embedding_41", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_505", 0, 0, {}]]]}, {"name": "reshape_464", "class_name": "Reshape", "config": {"name": "reshape_464", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_0", 0, 0, {}]]]}, {"name": "reshape_465", "class_name": "Reshape", "config": {"name": "reshape_465", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "reshape_466", "class_name": "Reshape", "config": {"name": "reshape_466", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "reshape_467", "class_name": "Reshape", "config": {"name": "reshape_467", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "reshape_468", "class_name": "Reshape", "config": {"name": "reshape_468", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "reshape_469", "class_name": "Reshape", "config": {"name": "reshape_469", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "reshape_470", "class_name": "Reshape", "config": {"name": "reshape_470", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"name": "reshape_471", "class_name": "Reshape", "config": {"name": "reshape_471", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"name": "reshape_472", "class_name": "Reshape", "config": {"name": "reshape_472", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_8", 0, 0, {}]]]}, {"name": "reshape_473", "class_name": "Reshape", "config": {"name": "reshape_473", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_9", 0, 0, {}]]]}, {"name": "reshape_474", "class_name": "Reshape", "config": {"name": "reshape_474", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_10", 0, 0, {}]]]}, {"name": "reshape_475", "class_name": "Reshape", "config": {"name": "reshape_475", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_11", 0, 0, {}]]]}, {"name": "reshape_476", "class_name": "Reshape", "config": {"name": "reshape_476", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_12", 0, 0, {}]]]}, {"name": "reshape_477", "class_name": "Reshape", "config": {"name": "reshape_477", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "reshape_478", "class_name": "Reshape", "config": {"name": "reshape_478", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"name": "reshape_479", "class_name": "Reshape", "config": {"name": "reshape_479", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_15", 0, 0, {}]]]}, {"name": "reshape_480", "class_name": "Reshape", "config": {"name": "reshape_480", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_16", 0, 0, {}]]]}, {"name": "reshape_481", "class_name": "Reshape", "config": {"name": "reshape_481", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_17", 0, 0, {}]]]}, {"name": "reshape_482", "class_name": "Reshape", "config": {"name": "reshape_482", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_18", 0, 0, {}]]]}, {"name": "reshape_483", "class_name": "Reshape", "config": {"name": "reshape_483", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"name": "reshape_484", "class_name": "Reshape", "config": {"name": "reshape_484", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"name": "reshape_485", "class_name": "Reshape", "config": {"name": "reshape_485", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_21", 0, 0, {}]]]}, {"name": "reshape_486", "class_name": "Reshape", "config": {"name": "reshape_486", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_22", 0, 0, {}]]]}, {"name": "reshape_487", "class_name": "Reshape", "config": {"name": "reshape_487", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_23", 0, 0, {}]]]}, {"name": "reshape_488", "class_name": "Reshape", "config": {"name": "reshape_488", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_24", 0, 0, {}]]]}, {"name": "reshape_489", "class_name": "Reshape", "config": {"name": "reshape_489", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_25", 0, 0, {}]]]}, {"name": "reshape_490", "class_name": "Reshape", "config": {"name": "reshape_490", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_26", 0, 0, {}]]]}, {"name": "reshape_491", "class_name": "Reshape", "config": {"name": "reshape_491", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_27", 0, 0, {}]]]}, {"name": "reshape_492", "class_name": "Reshape", "config": {"name": "reshape_492", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_28", 0, 0, {}]]]}, {"name": "reshape_493", "class_name": "Reshape", "config": {"name": "reshape_493", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_29", 0, 0, {}]]]}, {"name": "reshape_494", "class_name": "Reshape", "config": {"name": "reshape_494", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_30", 0, 0, {}]]]}, {"name": "reshape_495", "class_name": "Reshape", "config": {"name": "reshape_495", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_31", 0, 0, {}]]]}, {"name": "reshape_496", "class_name": "Reshape", "config": {"name": "reshape_496", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_32", 0, 0, {}]]]}, {"name": "reshape_497", "class_name": "Reshape", "config": {"name": "reshape_497", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_33", 0, 0, {}]]]}, {"name": "reshape_498", "class_name": "Reshape", "config": {"name": "reshape_498", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_34", 0, 0, {}]]]}, {"name": "reshape_499", "class_name": "Reshape", "config": {"name": "reshape_499", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_35", 0, 0, {}]]]}, {"name": "reshape_500", "class_name": "Reshape", "config": {"name": "reshape_500", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_36", 0, 0, {}]]]}, {"name": "reshape_501", "class_name": "Reshape", "config": {"name": "reshape_501", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_37", 0, 0, {}]]]}, {"name": "reshape_502", "class_name": "Reshape", "config": {"name": "reshape_502", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_38", 0, 0, {}]]]}, {"name": "reshape_503", "class_name": "Reshape", "config": {"name": "reshape_503", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_39", 0, 0, {}]]]}, {"name": "reshape_504", "class_name": "Reshape", "config": {"name": "reshape_504", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_40", 0, 0, {}]]]}, {"name": "reshape_505", "class_name": "Reshape", "config": {"name": "reshape_505", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_41", 0, 0, {}]]]}, {"name": "embedding", "class_name": "Concatenate", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["reshape_464", 0, 0, {}], ["reshape_465", 0, 0, {}], ["reshape_466", 0, 0, {}], ["reshape_467", 0, 0, {}], ["reshape_468", 0, 0, {}], ["reshape_469", 0, 0, {}], ["reshape_470", 0, 0, {}], ["reshape_471", 0, 0, {}], ["reshape_472", 0, 0, {}], ["reshape_473", 0, 0, {}], ["reshape_474", 0, 0, {}], ["reshape_475", 0, 0, {}], ["reshape_476", 0, 0, {}], ["reshape_477", 0, 0, {}], ["reshape_478", 0, 0, {}], ["reshape_479", 0, 0, {}], ["reshape_480", 0, 0, {}], ["reshape_481", 0, 0, {}], ["reshape_482", 0, 0, {}], ["reshape_483", 0, 0, {}], ["reshape_484", 0, 0, {}], ["reshape_485", 0, 0, {}], ["reshape_486", 0, 0, {}], ["reshape_487", 0, 0, {}], ["reshape_488", 0, 0, {}], ["reshape_489", 0, 0, {}], ["reshape_490", 0, 0, {}], ["reshape_491", 0, 0, {}], ["reshape_492", 0, 0, {}], ["reshape_493", 0, 0, {}], ["reshape_494", 0, 0, {}], ["reshape_495", 0, 0, {}], ["reshape_496", 0, 0, {}], ["reshape_497", 0, 0, {}], ["reshape_498", 0, 0, {}], ["reshape_499", 0, 0, {}], ["reshape_500", 0, 0, {}], ["reshape_501", 0, 0, {}], ["reshape_502", 0, 0, {}], ["reshape_503", 0, 0, {}], ["reshape_504", 0, 0, {}], ["reshape_505", 0, 0, {}]]]}, {"name": "fully-connected-1", "class_name": "Dense", "config": {"name": "fully-connected-1", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "activation_37", "class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-1", 0, 0, {}]]]}, {"name": "fully-connected-2", "class_name": "Dense", "config": {"name": "fully-connected-2", "trainable": true, "dtype": "float32", "units": 500, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_37", 0, 0, {}]]]}, {"name": "activation_38", "class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-2", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_38", 0, 0, {}]]]}, {"name": "activation_39", "class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["output", 0, 0, {}]]]}], "input_layers": [["input_464", 0, 0], ["input_465", 0, 0], ["input_466", 0, 0], ["input_467", 0, 0], ["input_468", 0, 0], ["input_469", 0, 0], ["input_470", 0, 0], ["input_471", 0, 0], ["input_472", 0, 0], ["input_473", 0, 0], ["input_474", 0, 0], ["input_475", 0, 0], ["input_476", 0, 0], ["input_477", 0, 0], ["input_478", 0, 0], ["input_479", 0, 0], ["input_480", 0, 0], ["input_481", 0, 0], ["input_482", 0, 0], ["input_483", 0, 0], ["input_484", 0, 0], ["input_485", 0, 0], ["input_486", 0, 0], ["input_487", 0, 0], ["input_488", 0, 0], ["input_489", 0, 0], ["input_490", 0, 0], ["input_491", 0, 0], ["input_492", 0, 0], ["input_493", 0, 0], ["input_494", 0, 0], ["input_495", 0, 0], ["input_496", 0, 0], ["input_497", 0, 0], ["input_498", 0, 0], ["input_499", 0, 0], ["input_500", 0, 0], ["input_501", 0, 0], ["input_502", 0, 0], ["input_503", 0, 0], ["input_504", 0, 0], ["input_505", 0, 0]], "output_layers": [["activation_39", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}