{"class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_299", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_299"}, "inbound_nodes": []}, {"name": "input_300", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_300"}, "inbound_nodes": []}, {"name": "input_301", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_301"}, "inbound_nodes": []}, {"name": "input_302", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_302"}, "inbound_nodes": []}, {"name": "input_303", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_303"}, "inbound_nodes": []}, {"name": "input_304", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_304"}, "inbound_nodes": []}, {"name": "input_305", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_305"}, "inbound_nodes": []}, {"name": "input_306", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_306"}, "inbound_nodes": []}, {"name": "input_307", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_307"}, "inbound_nodes": []}, {"name": "input_308", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_308"}, "inbound_nodes": []}, {"name": "input_309", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_309"}, "inbound_nodes": []}, {"name": "input_310", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_310"}, "inbound_nodes": []}, {"name": "input_311", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_311"}, "inbound_nodes": []}, {"name": "input_312", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_312"}, "inbound_nodes": []}, {"name": "input_313", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_313"}, "inbound_nodes": []}, {"name": "input_314", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_314"}, "inbound_nodes": []}, {"name": "input_315", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_315"}, "inbound_nodes": []}, {"name": "input_316", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_316"}, "inbound_nodes": []}, {"name": "input_317", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_317"}, "inbound_nodes": []}, {"name": "input_318", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_318"}, "inbound_nodes": []}, {"name": "input_319", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_319"}, "inbound_nodes": []}, {"name": "input_320", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_320"}, "inbound_nodes": []}, {"name": "input_321", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_321"}, "inbound_nodes": []}, {"name": "input_322", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_322"}, "inbound_nodes": []}, {"name": "input_323", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_323"}, "inbound_nodes": []}, {"name": "input_324", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_324"}, "inbound_nodes": []}, {"name": "input_325", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_325"}, "inbound_nodes": []}, {"name": "input_326", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_326"}, "inbound_nodes": []}, {"name": "input_327", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_327"}, "inbound_nodes": []}, {"name": "input_328", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_328"}, "inbound_nodes": []}, {"name": "input_329", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_329"}, "inbound_nodes": []}, {"name": "input_330", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_330"}, "inbound_nodes": []}, {"name": "input_331", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_331"}, "inbound_nodes": []}, {"name": "input_332", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_332"}, "inbound_nodes": []}, {"name": "input_333", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_333"}, "inbound_nodes": []}, {"name": "embedding_0", "class_name": "Embedding", "config": {"name": "embedding_0", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_299", 0, 0, {}]]]}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_300", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_301", 0, 0, {}]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_302", 0, 0, {}]]]}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_303", 0, 0, {}]]]}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_304", 0, 0, {}]]]}, {"name": "embedding_6", "class_name": "Embedding", "config": {"name": "embedding_6", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_305", 0, 0, {}]]]}, {"name": "embedding_7", "class_name": "Embedding", "config": {"name": "embedding_7", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_306", 0, 0, {}]]]}, {"name": "embedding_8", "class_name": "Embedding", "config": {"name": "embedding_8", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_307", 0, 0, {}]]]}, {"name": "embedding_9", "class_name": "Embedding", "config": {"name": "embedding_9", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_308", 0, 0, {}]]]}, {"name": "embedding_10", "class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_309", 0, 0, {}]]]}, {"name": "embedding_11", "class_name": "Embedding", "config": {"name": "embedding_11", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_310", 0, 0, {}]]]}, {"name": "embedding_12", "class_name": "Embedding", "config": {"name": "embedding_12", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_311", 0, 0, {}]]]}, {"name": "embedding_13", "class_name": "Embedding", "config": {"name": "embedding_13", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_312", 0, 0, {}]]]}, {"name": "embedding_14", "class_name": "Embedding", "config": {"name": "embedding_14", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_313", 0, 0, {}]]]}, {"name": "embedding_15", "class_name": "Embedding", "config": {"name": "embedding_15", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_314", 0, 0, {}]]]}, {"name": "embedding_16", "class_name": "Embedding", "config": {"name": "embedding_16", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_315", 0, 0, {}]]]}, {"name": "embedding_17", "class_name": "Embedding", "config": {"name": "embedding_17", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_316", 0, 0, {}]]]}, {"name": "embedding_18", "class_name": "Embedding", "config": {"name": "embedding_18", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_317", 0, 0, {}]]]}, {"name": "embedding_19", "class_name": "Embedding", "config": {"name": "embedding_19", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_318", 0, 0, {}]]]}, {"name": "embedding_20", "class_name": "Embedding", "config": {"name": "embedding_20", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_319", 0, 0, {}]]]}, {"name": "embedding_21", "class_name": "Embedding", "config": {"name": "embedding_21", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_320", 0, 0, {}]]]}, {"name": "embedding_22", "class_name": "Embedding", "config": {"name": "embedding_22", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_321", 0, 0, {}]]]}, {"name": "embedding_23", "class_name": "Embedding", "config": {"name": "embedding_23", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_322", 0, 0, {}]]]}, {"name": "embedding_24", "class_name": "Embedding", "config": {"name": "embedding_24", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_323", 0, 0, {}]]]}, {"name": "embedding_25", "class_name": "Embedding", "config": {"name": "embedding_25", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_324", 0, 0, {}]]]}, {"name": "embedding_26", "class_name": "Embedding", "config": {"name": "embedding_26", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_325", 0, 0, {}]]]}, {"name": "embedding_27", "class_name": "Embedding", "config": {"name": "embedding_27", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_326", 0, 0, {}]]]}, {"name": "embedding_28", "class_name": "Embedding", "config": {"name": "embedding_28", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 5, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_327", 0, 0, {}]]]}, {"name": "embedding_29", "class_name": "Embedding", "config": {"name": "embedding_29", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_328", 0, 0, {}]]]}, {"name": "embedding_30", "class_name": "Embedding", "config": {"name": "embedding_30", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_329", 0, 0, {}]]]}, {"name": "embedding_31", "class_name": "Embedding", "config": {"name": "embedding_31", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_330", 0, 0, {}]]]}, {"name": "embedding_32", "class_name": "Embedding", "config": {"name": "embedding_32", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_331", 0, 0, {}]]]}, {"name": "embedding_33", "class_name": "Embedding", "config": {"name": "embedding_33", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_332", 0, 0, {}]]]}, {"name": "embedding_34", "class_name": "Embedding", "config": {"name": "embedding_34", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_333", 0, 0, {}]]]}, {"name": "reshape_299", "class_name": "Reshape", "config": {"name": "reshape_299", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_0", 0, 0, {}]]]}, {"name": "reshape_300", "class_name": "Reshape", "config": {"name": "reshape_300", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "reshape_301", "class_name": "Reshape", "config": {"name": "reshape_301", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "reshape_302", "class_name": "Reshape", "config": {"name": "reshape_302", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "reshape_303", "class_name": "Reshape", "config": {"name": "reshape_303", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "reshape_304", "class_name": "Reshape", "config": {"name": "reshape_304", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "reshape_305", "class_name": "Reshape", "config": {"name": "reshape_305", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_6", 0, 0, {}]]]}, {"name": "reshape_306", "class_name": "Reshape", "config": {"name": "reshape_306", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_7", 0, 0, {}]]]}, {"name": "reshape_307", "class_name": "Reshape", "config": {"name": "reshape_307", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_8", 0, 0, {}]]]}, {"name": "reshape_308", "class_name": "Reshape", "config": {"name": "reshape_308", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_9", 0, 0, {}]]]}, {"name": "reshape_309", "class_name": "Reshape", "config": {"name": "reshape_309", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_10", 0, 0, {}]]]}, {"name": "reshape_310", "class_name": "Reshape", "config": {"name": "reshape_310", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_11", 0, 0, {}]]]}, {"name": "reshape_311", "class_name": "Reshape", "config": {"name": "reshape_311", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_12", 0, 0, {}]]]}, {"name": "reshape_312", "class_name": "Reshape", "config": {"name": "reshape_312", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_13", 0, 0, {}]]]}, {"name": "reshape_313", "class_name": "Reshape", "config": {"name": "reshape_313", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_14", 0, 0, {}]]]}, {"name": "reshape_314", "class_name": "Reshape", "config": {"name": "reshape_314", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_15", 0, 0, {}]]]}, {"name": "reshape_315", "class_name": "Reshape", "config": {"name": "reshape_315", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_16", 0, 0, {}]]]}, {"name": "reshape_316", "class_name": "Reshape", "config": {"name": "reshape_316", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_17", 0, 0, {}]]]}, {"name": "reshape_317", "class_name": "Reshape", "config": {"name": "reshape_317", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_18", 0, 0, {}]]]}, {"name": "reshape_318", "class_name": "Reshape", "config": {"name": "reshape_318", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_19", 0, 0, {}]]]}, {"name": "reshape_319", "class_name": "Reshape", "config": {"name": "reshape_319", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_20", 0, 0, {}]]]}, {"name": "reshape_320", "class_name": "Reshape", "config": {"name": "reshape_320", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_21", 0, 0, {}]]]}, {"name": "reshape_321", "class_name": "Reshape", "config": {"name": "reshape_321", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_22", 0, 0, {}]]]}, {"name": "reshape_322", "class_name": "Reshape", "config": {"name": "reshape_322", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_23", 0, 0, {}]]]}, {"name": "reshape_323", "class_name": "Reshape", "config": {"name": "reshape_323", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_24", 0, 0, {}]]]}, {"name": "reshape_324", "class_name": "Reshape", "config": {"name": "reshape_324", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_25", 0, 0, {}]]]}, {"name": "reshape_325", "class_name": "Reshape", "config": {"name": "reshape_325", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_26", 0, 0, {}]]]}, {"name": "reshape_326", "class_name": "Reshape", "config": {"name": "reshape_326", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_27", 0, 0, {}]]]}, {"name": "reshape_327", "class_name": "Reshape", "config": {"name": "reshape_327", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_28", 0, 0, {}]]]}, {"name": "reshape_328", "class_name": "Reshape", "config": {"name": "reshape_328", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_29", 0, 0, {}]]]}, {"name": "reshape_329", "class_name": "Reshape", "config": {"name": "reshape_329", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_30", 0, 0, {}]]]}, {"name": "reshape_330", "class_name": "Reshape", "config": {"name": "reshape_330", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_31", 0, 0, {}]]]}, {"name": "reshape_331", "class_name": "Reshape", "config": {"name": "reshape_331", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_32", 0, 0, {}]]]}, {"name": "reshape_332", "class_name": "Reshape", "config": {"name": "reshape_332", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_33", 0, 0, {}]]]}, {"name": "reshape_333", "class_name": "Reshape", "config": {"name": "reshape_333", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_34", 0, 0, {}]]]}, {"name": "embedding", "class_name": "Concatenate", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["reshape_299", 0, 0, {}], ["reshape_300", 0, 0, {}], ["reshape_301", 0, 0, {}], ["reshape_302", 0, 0, {}], ["reshape_303", 0, 0, {}], ["reshape_304", 0, 0, {}], ["reshape_305", 0, 0, {}], ["reshape_306", 0, 0, {}], ["reshape_307", 0, 0, {}], ["reshape_308", 0, 0, {}], ["reshape_309", 0, 0, {}], ["reshape_310", 0, 0, {}], ["reshape_311", 0, 0, {}], ["reshape_312", 0, 0, {}], ["reshape_313", 0, 0, {}], ["reshape_314", 0, 0, {}], ["reshape_315", 0, 0, {}], ["reshape_316", 0, 0, {}], ["reshape_317", 0, 0, {}], ["reshape_318", 0, 0, {}], ["reshape_319", 0, 0, {}], ["reshape_320", 0, 0, {}], ["reshape_321", 0, 0, {}], ["reshape_322", 0, 0, {}], ["reshape_323", 0, 0, {}], ["reshape_324", 0, 0, {}], ["reshape_325", 0, 0, {}], ["reshape_326", 0, 0, {}], ["reshape_327", 0, 0, {}], ["reshape_328", 0, 0, {}], ["reshape_329", 0, 0, {}], ["reshape_330", 0, 0, {}], ["reshape_331", 0, 0, {}], ["reshape_332", 0, 0, {}], ["reshape_333", 0, 0, {}]]]}, {"name": "fully-connected-1", "class_name": "Dense", "config": {"name": "fully-connected-1", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-1", 0, 0, {}]]]}, {"name": "fully-connected-2", "class_name": "Dense", "config": {"name": "fully-connected-2", "trainable": true, "dtype": "float32", "units": 500, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-2", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 19, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["output", 0, 0, {}]]]}], "input_layers": [["input_299", 0, 0], ["input_300", 0, 0], ["input_301", 0, 0], ["input_302", 0, 0], ["input_303", 0, 0], ["input_304", 0, 0], ["input_305", 0, 0], ["input_306", 0, 0], ["input_307", 0, 0], ["input_308", 0, 0], ["input_309", 0, 0], ["input_310", 0, 0], ["input_311", 0, 0], ["input_312", 0, 0], ["input_313", 0, 0], ["input_314", 0, 0], ["input_315", 0, 0], ["input_316", 0, 0], ["input_317", 0, 0], ["input_318", 0, 0], ["input_319", 0, 0], ["input_320", 0, 0], ["input_321", 0, 0], ["input_322", 0, 0], ["input_323", 0, 0], ["input_324", 0, 0], ["input_325", 0, 0], ["input_326", 0, 0], ["input_327", 0, 0], ["input_328", 0, 0], ["input_329", 0, 0], ["input_330", 0, 0], ["input_331", 0, 0], ["input_332", 0, 0], ["input_333", 0, 0]], "output_layers": [["activation_12", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}