{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "input_403", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_403"}, "inbound_nodes": []}, {"name": "input_404", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_404"}, "inbound_nodes": []}, {"name": "input_405", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_405"}, "inbound_nodes": []}, {"name": "input_406", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_406"}, "inbound_nodes": []}, {"name": "input_407", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_407"}, "inbound_nodes": []}, {"name": "input_408", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_408"}, "inbound_nodes": []}, {"name": "embedding_0", "class_name": "Embedding", "config": {"name": "embedding_0", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_403", 0, 0, {}]]]}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_404", 0, 0, {}]]]}, {"name": "embedding_2", "class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_405", 0, 0, {}]]]}, {"name": "embedding_3", "class_name": "Embedding", "config": {"name": "embedding_3", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 3, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_406", 0, 0, {}]]]}, {"name": "embedding_4", "class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 4, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_407", 0, 0, {}]]]}, {"name": "embedding_5", "class_name": "Embedding", "config": {"name": "embedding_5", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 6, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_408", 0, 0, {}]]]}, {"name": "reshape_403", "class_name": "Reshape", "config": {"name": "reshape_403", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_0", 0, 0, {}]]]}, {"name": "reshape_404", "class_name": "Reshape", "config": {"name": "reshape_404", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "reshape_405", "class_name": "Reshape", "config": {"name": "reshape_405", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"name": "reshape_406", "class_name": "Reshape", "config": {"name": "reshape_406", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"name": "reshape_407", "class_name": "Reshape", "config": {"name": "reshape_407", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"name": "reshape_408", "class_name": "Reshape", "config": {"name": "reshape_408", "trainable": true, "dtype": "float32", "target_shape": [6]}, "inbound_nodes": [[["embedding_5", 0, 0, {}]]]}, {"name": "embedding", "class_name": "Concatenate", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["reshape_403", 0, 0, {}], ["reshape_404", 0, 0, {}], ["reshape_405", 0, 0, {}], ["reshape_406", 0, 0, {}], ["reshape_407", 0, 0, {}], ["reshape_408", 0, 0, {}]]]}, {"name": "fully-connected-1", "class_name": "Dense", "config": {"name": "fully-connected-1", "trainable": true, "dtype": "float32", "units": 1000, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-1", 0, 0, {}]]]}, {"name": "fully-connected-2", "class_name": "Dense", "config": {"name": "fully-connected-2", "trainable": true, "dtype": "float32", "units": 500, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["fully-connected-2", 0, 0, {}]]]}, {"name": "output", "class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["output", 0, 0, {}]]]}], "input_layers": [["input_403", 0, 0], ["input_404", 0, 0], ["input_405", 0, 0], ["input_406", 0, 0], ["input_407", 0, 0], ["input_408", 0, 0]], "output_layers": [["activation_21", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}